[NoCoverage] BlockStatement
product/src/application/select-product-use-case.ts:14:51
     private readonly _store: ProductStoreService,
     private readonly _errorHandler: ErrorHandlingService
   ) {}
-  execute(product: IProduct): Observable<boolean> {
-    return of(this._store.setSelectedProduct(product)).pipe(
-      map(() => true),
-      catchError((error) => {
-        console.error('Error selecting product:', error);
-        this._errorHandler.handleError(
-          error,
-          `Error selecting product with ID ${product.id}`
-        );
-        return of(false);
-      }),
-      finalize(() => this._store.setLoading(false))
-    );
-  }
+  execute(product: IProduct): Observable<boolean> {}
 }
 

[NoCoverage] BooleanLiteral
product/src/application/select-product-use-case.ts:16:17
   ) {}
   execute(product: IProduct): Observable<boolean> {
     return of(this._store.setSelectedProduct(product)).pipe(
-      map(() => true),
+      map(() => false),
       catchError((error) => {
         console.error('Error selecting product:', error);

[NoCoverage] ArrowFunction
product/src/application/select-product-use-case.ts:16:11
   ) {}
   execute(product: IProduct): Observable<boolean> {
     return of(this._store.setSelectedProduct(product)).pipe(
-      map(() => true),
+      map(() => undefined),
       catchError((error) => {
         console.error('Error selecting product:', error);

[NoCoverage] StringLiteral
product/src/application/select-product-use-case.ts:21:11
         console.error('Error selecting product:', error);
         this._errorHandler.handleError(
           error,
-          `Error selecting product with ID ${product.id}`
+          ``
         );
         return of(false);

[NoCoverage] BooleanLiteral
product/src/application/select-product-use-case.ts:23:19
           error,
           `Error selecting product with ID ${product.id}`
         );
-        return of(false);
+        return of(true);
       }),
       finalize(() => this._store.setLoading(false))
