[NoCoverage] StringLiteral
product/src/application/update.product.use.case.ts:42:11
         console.error(`Error updating product with ID ${input.id}:`, error);
         this._errorHandler.handleError(
           error,
-          `Error updating product with ID ${input.id}`
+          ``
         );
         return throwError(() => error);

[NoCoverage] ArrowFunction
product/src/application/update.product.use.case.ts:44:27
           error,
           `Error updating product with ID ${input.id}`
         );
-        return throwError(() => error);
+        return throwError(() => undefined);
       }),
       finalize(() => {
