[Survived] ArrowFunction
product/src/application/delete.product.use.case.ts:38:27
       }),
       catchError((error) => {
         this._errorHandler.handleError(error, `Product deletion failed: ${id}`);
-        return throwError(() => error);
+        return throwError(() => undefined);
       }),
       finalize(() => this._store.setLoading(false))
