[Killed] BlockStatement
product/src/application/create.product.use.case.ts:26:79
     private readonly _toastService: ToastService
   ) {}
 
-  execute(product: ICreateProductRequest): Observable<ICreateProductResponse> {
-    this._store.setLoading(true);
-    return this._service.createProduct(product).pipe(
-      tap((response) => {
-        this._store.addProduct(response.data);
-        this._toastService.showToast(
-          'Operación Exitosa',
-          `Product "${product.name}" created successfully`,
-          'success'
-        );
-      }),
-      catchError((error) =>
-        this._errorHandler.handleError(
-          error,
-          `Product creation failed: ${product.name}`
-        )
-      ),
-      finalize(() => this._store.setLoading(false))
-    );
-  }
+  execute(product: ICreateProductRequest): Observable<ICreateProductResponse> {}
 }
 
killedBy: CreateProductUseCase (Vitest) should call API and update store on success
statusReason: Cannot read properties of undefined (reading 'subscribe')

[Killed] BooleanLiteral
product/src/application/create.product.use.case.ts:27:28
   ) {}
 
   execute(product: ICreateProductRequest): Observable<ICreateProductResponse> {
-    this._store.setLoading(true);
+    this._store.setLoading(false);
     return this._service.createProduct(product).pipe(
       tap((response) => {
killedBy: CreateProductUseCase (Vitest) should call API and update store on success
statusReason: expected "vi.fn()" to be called with arguments: [ true ]

Received: 

  1st vi.fn() call:

  [
-   true,

[Killed] BlockStatement
product/src/application/create.product.use.case.ts:29:25
   execute(product: ICreateProductRequest): Observable<ICreateProductResponse> {
     this._store.setLoading(true);
     return this._service.createProduct(product).pipe(
-      tap((response) => {
-        this._store.addProduct(response.data);
-        this._toastService.showToast(
-          'Operación Exitosa',
-          `Product "${product.name}" created successfully`,
-          'success'
-        );
-      }),
+      tap((response) => {}),
       catchError((error) =>
         this._errorHandler.handleError(
killedBy: CreateProductUseCase (Vitest) should call API and update store on success
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'P01', name: 'Test', …(4) } ]

Number of calls: 0

[Killed] StringLiteral
product/src/application/create.product.use.case.ts:32:11
       tap((response) => {
         this._store.addProduct(response.data);
         this._toastService.showToast(
-          'Operación Exitosa',
+          "",
           `Product "${product.name}" created successfully`,
           'success'
killedBy: CreateProductUseCase (Vitest) should call showToast with correct success message
statusReason: expected "vi.fn()" to be called with arguments: [ 'Operación Exitosa', …(2) ]

Received: 

  1st vi.fn() call:

  [
-   "Operación Exitosa",

[Survived] StringLiteral
product/src/application/create.product.use.case.ts:40:11
       catchError((error) =>
         this._errorHandler.handleError(
           error,
-          `Product creation failed: ${product.name}`
+          ``
         )
       ),

[Killed] BooleanLiteral
product/src/application/create.product.use.case.ts:43:45
           `Product creation failed: ${product.name}`
         )
       ),
-      finalize(() => this._store.setLoading(false))
+      finalize(() => this._store.setLoading(true))
     );
   }
killedBy: CreateProductUseCase (Vitest) should call API and update store on success
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Received: 

  1st vi.fn() call:

  [
-   false,

[Killed] ArrowFunction
product/src/application/create.product.use.case.ts:43:16
           `Product creation failed: ${product.name}`
         )
       ),
-      finalize(() => this._store.setLoading(false))
+      finalize(() => undefined)
     );
   }
killedBy: CreateProductUseCase (Vitest) should call API and update store on success
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Received: 

  1st vi.fn() call:

  [
-   false,
