[Killed] BlockStatement
product/src/application/delete.product.use.case.ts:25:59
     private readonly _toastService: ToastService
   ) {}
 
-  execute(id: string): Observable<IDeleteProductResponse> {
-    this._store.setLoading(true);
-    return this._service.deleteProduct(id).pipe(
-      tap(() => {
-        this._store.deleteProduct(id);
-        this._toastService.showToast(
-          'Operación Exitosa',
-          `Producto eliminado correctamente`,
-          'success'
-        );
-      }),
-      catchError((error) => {
-        this._errorHandler.handleError(error, `Product deletion failed: ${id}`);
-        return throwError(() => error);
-      }),
-      finalize(() => this._store.setLoading(false))
-    );
-  }
+  execute(id: string): Observable<IDeleteProductResponse> {}
 }
 
killedBy: DeleteProductUseCase (Vitest) should call API, update store and show toast on success
statusReason: Cannot read properties of undefined (reading 'subscribe')

[Killed] BooleanLiteral
product/src/application/delete.product.use.case.ts:26:28
   ) {}
 
   execute(id: string): Observable<IDeleteProductResponse> {
-    this._store.setLoading(true);
+    this._store.setLoading(false);
     return this._service.deleteProduct(id).pipe(
       tap(() => {
killedBy: DeleteProductUseCase (Vitest) should call API, update store and show toast on success
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
product/src/application/delete.product.use.case.ts:28:17
   execute(id: string): Observable<IDeleteProductResponse> {
     this._store.setLoading(true);
     return this._service.deleteProduct(id).pipe(
-      tap(() => {
-        this._store.deleteProduct(id);
-        this._toastService.showToast(
-          'Operación Exitosa',
-          `Producto eliminado correctamente`,
-          'success'
-        );
-      }),
+      tap(() => {}),
       catchError((error) => {
         this._errorHandler.handleError(error, `Product deletion failed: ${id}`);
killedBy: DeleteProductUseCase (Vitest) should call API, update store and show toast on success
statusReason: expected "vi.fn()" to be called with arguments: [ 'PROD-123' ]

Number of calls: 0

[Killed] StringLiteral
product/src/application/delete.product.use.case.ts:32:11
         this._store.deleteProduct(id);
         this._toastService.showToast(
           'Operación Exitosa',
-          `Producto eliminado correctamente`,
+          ``,
           'success'
         );
killedBy: DeleteProductUseCase (Vitest) should show success toast with correct values
statusReason: expected "vi.fn()" to be called with arguments: [ 'Operación Exitosa', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "Operación Exitosa",

[Killed] BlockStatement
product/src/application/delete.product.use.case.ts:36:29
           'success'
         );
       }),
-      catchError((error) => {
-        this._errorHandler.handleError(error, `Product deletion failed: ${id}`);
-        return throwError(() => error);
-      }),
+      catchError((error) => {}),
       finalize(() => this._store.setLoading(false))
     );
killedBy: DeleteProductUseCase (Vitest) should handle error when API fails
statusReason: expected [Function] to throw error including 'Server error' but got 'You provided \'undefined\' where a st…'

[Killed] ArrowFunction
product/src/application/delete.product.use.case.ts:40:16
         this._errorHandler.handleError(error, `Product deletion failed: ${id}`);
         return throwError(() => error);
       }),
-      finalize(() => this._store.setLoading(false))
+      finalize(() => undefined)
     );
   }
killedBy: DeleteProductUseCase (Vitest) should call API, update store and show toast on success
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
product/src/application/delete.product.use.case.ts:40:45
         this._errorHandler.handleError(error, `Product deletion failed: ${id}`);
         return throwError(() => error);
       }),
-      finalize(() => this._store.setLoading(false))
+      finalize(() => this._store.setLoading(true))
     );
   }
killedBy: DeleteProductUseCase (Vitest) should call API, update store and show toast on success
statusReason: expected true to be false // Object.is equality
