[Killed] BooleanLiteral
product/src/application/get.products.use.case.ts:25:28
   ) {}
 
   execute(): Observable<IProduct[]> {
-    this._store.setLoading(true);
+    this._store.setLoading(false);
     return this._service.getAllProducts().pipe(
       map((response) => {
killedBy: GetAllProductsUseCase (Vitest) should start loading before calling API
statusReason: expected "vi.fn()" to be called with arguments: [ true ]

Received: 

  1st vi.fn() call:

  [
-   true,

[Killed] BlockStatement
product/src/application/get.products.use.case.ts:27:25
   execute(): Observable<IProduct[]> {
     this._store.setLoading(true);
     return this._service.getAllProducts().pipe(
-      map((response) => {
-        if (response.data.length === 0) {
-          this._toastService.showToast(
-            'Advertencia',
-            'No se encontraron productos',
-            'warning'
-          );
-        }
-        return response.data;
-      }), // Extrae los datos
+      map((response) => {}), // Extrae los datos
       tap((products) => {
         this._store.setProducts(products);
killedBy: GetAllProductsUseCase (Vitest) should set products in store when API returns data
statusReason: expected "vi.fn()" to be called with arguments: [ [ { id: '1', name: 'P1' }, …(1) ] ]

Received: 

  1st vi.fn() call:

  [
-   [

[Killed] EqualityOperator
product/src/application/get.products.use.case.ts:28:13
     this._store.setLoading(true);
     return this._service.getAllProducts().pipe(
       map((response) => {
-        if (response.data.length === 0) {
+        if (response.data.length !== 0) {
           this._toastService.showToast(
             'Advertencia',
killedBy: GetAllProductsUseCase (Vitest) should show warning toast when API returns an empty list
statusReason: expected "vi.fn()" to be called with arguments: [ 'Advertencia', …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
product/src/application/get.products.use.case.ts:28:13
     this._store.setLoading(true);
     return this._service.getAllProducts().pipe(
       map((response) => {
-        if (response.data.length === 0) {
+        if (false) {
           this._toastService.showToast(
             'Advertencia',
killedBy: GetAllProductsUseCase (Vitest) should show warning toast when API returns an empty list
statusReason: expected "vi.fn()" to be called with arguments: [ 'Advertencia', …(2) ]

Number of calls: 0

[Killed] StringLiteral
product/src/application/get.products.use.case.ts:31:13
         if (response.data.length === 0) {
           this._toastService.showToast(
             'Advertencia',
-            'No se encontraron productos',
+            "",
             'warning'
           );
killedBy: GetAllProductsUseCase (Vitest) should show warning toast when API returns an empty list
statusReason: expected "vi.fn()" to be called with arguments: [ 'Advertencia', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "Advertencia",

[Killed] BlockStatement
product/src/application/get.products.use.case.ts:37:25
         }
         return response.data;
       }), // Extrae los datos
-      tap((products) => {
-        this._store.setProducts(products);
-      }),
+      tap((products) => {}),
       catchError((error) => {
         console.error('Error al obtener los productos:', error);
killedBy: GetAllProductsUseCase (Vitest) should set products in store when API returns data
statusReason: expected "vi.fn()" to be called with arguments: [ [ { id: '1', name: 'P1' }, …(1) ] ]

Number of calls: 0

[Killed] BlockStatement
product/src/application/get.products.use.case.ts:40:29
       tap((products) => {
         this._store.setProducts(products);
       }),
-      catchError((error) => {
-        console.error('Error al obtener los productos:', error);
-        this._errorHandler.handleError(error, 'Error fetching all products');
-        return throwError(() => error); // Re-lanza el error
-      }),
+      catchError((error) => {}),
       finalize(() => {
         this._store.setLoading(false);
killedBy: GetAllProductsUseCase (Vitest) should call error handler when API fails
statusReason: expected "vi.fn()" to be called with arguments: [ Error: Network fail, …(1) ]

Number of calls: 0

[Survived] ArrowFunction
product/src/application/get.products.use.case.ts:43:27
       catchError((error) => {
         console.error('Error al obtener los productos:', error);
         this._errorHandler.handleError(error, 'Error fetching all products');
-        return throwError(() => error); // Re-lanza el error
+        return throwError(() => undefined); // Re-lanza el error
       }),
       finalize(() => {

[Survived] BlockStatement
product/src/application/get.products.use.case.ts:45:22
         this._errorHandler.handleError(error, 'Error fetching all products');
         return throwError(() => error); // Re-lanza el error
       }),
-      finalize(() => {
-        this._store.setLoading(false);
-      })
+      finalize(() => {})
     );
   }

[Survived] BooleanLiteral
product/src/application/get.products.use.case.ts:46:32
         return throwError(() => error); // Re-lanza el error
       }),
       finalize(() => {
-        this._store.setLoading(false);
+        this._store.setLoading(true);
       })
     );
