[Killed] BlockStatement
product/src/application/getSelectedProductCase.ts:22:42
     private readonly _errorHandler: ErrorHandlingService
   ) {}
 
-  execute(): Observable<IProduct | null> {
-    return this._query.selectSelectedProduct().pipe(
-      catchError((err) => {
-        console.error('Error getting selected product:', err);
-        this._errorHandler.handleError(err, 'Error getting selected product');
-        return throwError(() => err);
-      }),
-      finalize(() => {
-        this._store.setLoading(false);
-      })
-    );
-  }
+  execute(): Observable<IProduct | null> {}
 }
 
killedBy: GetSelectedProductCase (Vitest) should return selected product when query emits a product
statusReason: Cannot read properties of undefined (reading 'subscribe')

[Survived] StringLiteral
product/src/application/getSelectedProductCase.ts:25:23
   execute(): Observable<IProduct | null> {
     return this._query.selectSelectedProduct().pipe(
       catchError((err) => {
-        console.error('Error getting selected product:', err);
+        console.error("", err);
         this._errorHandler.handleError(err, 'Error getting selected product');
         return throwError(() => err);
