[Killed] BlockStatement
product/src/application/product.exists.use.case.ts:17:44
     private readonly _errorHandler: ErrorHandlingService
   ) {}
 
-  execute(id: string): Observable<boolean> {
-    this._store.setLoading(true);
-    return this._service.productExists(id).pipe(
-      catchError((error) => {
-        return this._errorHandler.handleError(
-          error,
-          `Error checking if product with ID ${id} exists`
-        );
-      }),
-      finalize(() => {
-        this._store.setLoading(false);
-      })
-    );
-  }
+  execute(id: string): Observable<boolean> {}
 }
killedBy: ProductExistsUseCase (Vitest) should return API result when productExists emits value
statusReason: Cannot read properties of undefined (reading 'subscribe')

[Killed] BooleanLiteral
product/src/application/product.exists.use.case.ts:18:28
   ) {}
 
   execute(id: string): Observable<boolean> {
-    this._store.setLoading(true);
+    this._store.setLoading(false);
     return this._service.productExists(id).pipe(
       catchError((error) => {
killedBy: ProductExistsUseCase (Vitest) should call setLoading(true) then setLoading(false)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
product/src/application/product.exists.use.case.ts:20:29
   execute(id: string): Observable<boolean> {
     this._store.setLoading(true);
     return this._service.productExists(id).pipe(
-      catchError((error) => {
-        return this._errorHandler.handleError(
-          error,
-          `Error checking if product with ID ${id} exists`
-        );
-      }),
+      catchError((error) => {}),
       finalize(() => {
         this._store.setLoading(false);
killedBy: ProductExistsUseCase (Vitest) should call handleError when API throws error
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
