[Killed] BlockStatement
product/src/application/select-product-use-case.ts:19:51
     private readonly _store: ProductStoreService,
     private readonly _errorHandler: ErrorHandlingService
   ) {}
-  execute(product: IProduct): Observable<boolean> {
-    return defer(() => of(this._store.setSelectedProduct(product))).pipe(
-      map(() => true),
-      catchError((error) => {
-        console.error('Error selecting product:', error);
-        this._errorHandler.handleError(
-          error,
-          `Error selecting product with ID ${product.id}`
-        );
-        return of(false);
-      }),
-      finalize(() => this._store.setLoading(false))
-    );
-  }
+  execute(product: IProduct): Observable<boolean> {}
 }
 
killedBy: SelectProductCase (Vitest) should return true when product is selected successfully
statusReason: Cannot read properties of undefined (reading 'subscribe')

[Killed] ArrowFunction
product/src/application/select-product-use-case.ts:20:18
     private readonly _errorHandler: ErrorHandlingService
   ) {}
   execute(product: IProduct): Observable<boolean> {
-    return defer(() => of(this._store.setSelectedProduct(product))).pipe(
+    return defer(() => undefined).pipe(
       map(() => true),
       catchError((error) => {
killedBy: SelectProductCase (Vitest) should return true when product is selected successfully
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'P1' } ]

Number of calls: 0

[Killed] BlockStatement
product/src/application/select-product-use-case.ts:22:29
   execute(product: IProduct): Observable<boolean> {
     return defer(() => of(this._store.setSelectedProduct(product))).pipe(
       map(() => true),
-      catchError((error) => {
-        console.error('Error selecting product:', error);
-        this._errorHandler.handleError(
-          error,
-          `Error selecting product with ID ${product.id}`
-        );
-        return of(false);
-      }),
+      catchError((error) => {}),
       finalize(() => this._store.setLoading(false))
     );
killedBy: SelectProductCase (Vitest) should log correct error message when selection fails
statusReason: expected "error" to be called with arguments: [ 'Error selecting product:', …(1) ]

Number of calls: 0

[Killed] StringLiteral
product/src/application/select-product-use-case.ts:23:23
     return defer(() => of(this._store.setSelectedProduct(product))).pipe(
       map(() => true),
       catchError((error) => {
-        console.error('Error selecting product:', error);
+        console.error("", error);
         this._errorHandler.handleError(
           error,
killedBy: SelectProductCase (Vitest) should log correct error message when selection fails
statusReason: expected "error" to be called with arguments: [ 'Error selecting product:', …(1) ]

Received: 

  1st error call:

  [
-   "Error selecting product:",
