[Killed] BlockStatement
product/src/application/translate.use.case.ts:19:35
     private readonly _errorHandler: ErrorHandlingService
   ) {}
 
-  execute(language: string): void {
-    this._store.setLoading(true);
-    this._I18nTranslateService.loadTranslations(language).subscribe({
-      next: (response: TranslationMapItem) => {
-        this._store.setCurrentLanguage(language);
-        this._store.setTranslations(response);
-      },
-      error: (error) => {
-        this._errorHandler.handleError(error, 'Failed to load translations.');
-        this._store.setLoading(false);
-      },
-      complete: () => {
-        this._store.setLoading(false);
-      },
-    });
-  }
+  execute(language: string): void {}
 }
 
killedBy: LoadTranslationsUseCase (Vitest) should load translations, update store and stop loading on success
statusReason: expected "vi.fn()" to be called with arguments: [ true ]

Number of calls: 0

[Killed] BooleanLiteral
product/src/application/translate.use.case.ts:20:28
   ) {}
 
   execute(language: string): void {
-    this._store.setLoading(true);
+    this._store.setLoading(false);
     this._I18nTranslateService.loadTranslations(language).subscribe({
       next: (response: TranslationMapItem) => {
killedBy: LoadTranslationsUseCase (Vitest) should load translations, update store and stop loading on success
statusReason: expected "vi.fn()" to be called with arguments: [ true ]

Received: 

  1st vi.fn() call:

  [
-   true,

[Killed] ObjectLiteral
product/src/application/translate.use.case.ts:21:69
 
   execute(language: string): void {
     this._store.setLoading(true);
-    this._I18nTranslateService.loadTranslations(language).subscribe({
-      next: (response: TranslationMapItem) => {
-        this._store.setCurrentLanguage(language);
-        this._store.setTranslations(response);
-      },
-      error: (error) => {
-        this._errorHandler.handleError(error, 'Failed to load translations.');
-        this._store.setLoading(false);
-      },
-      complete: () => {
-        this._store.setLoading(false);
-      },
-    });
+    this._I18nTranslateService.loadTranslations(language).subscribe({});
   }
 }
killedBy: LoadTranslationsUseCase (Vitest) should load translations, update store and stop loading on success
statusReason: expected "vi.fn()" to be called with arguments: [ 'es' ]

Number of calls: 0

[Killed] BlockStatement
product/src/application/translate.use.case.ts:22:47
   execute(language: string): void {
     this._store.setLoading(true);
     this._I18nTranslateService.loadTranslations(language).subscribe({
-      next: (response: TranslationMapItem) => {
-        this._store.setCurrentLanguage(language);
-        this._store.setTranslations(response);
-      },
+      next: (response: TranslationMapItem) => {},
       error: (error) => {
         this._errorHandler.handleError(error, 'Failed to load translations.');
killedBy: LoadTranslationsUseCase (Vitest) should load translations, update store and stop loading on success
statusReason: expected "vi.fn()" to be called with arguments: [ 'es' ]

Number of calls: 0

[Killed] BlockStatement
product/src/application/translate.use.case.ts:26:25
         this._store.setCurrentLanguage(language);
         this._store.setTranslations(response);
       },
-      error: (error) => {
-        this._errorHandler.handleError(error, 'Failed to load translations.');
-        this._store.setLoading(false);
-      },
+      error: (error) => {},
       complete: () => {
         this._store.setLoading(false);
killedBy: LoadTranslationsUseCase (Vitest) should call error handler and setLoading(false) on error
statusReason: expected "vi.fn()" to be called with arguments: [ Error: Network fail, …(1) ]

Number of calls: 0

[Killed] StringLiteral
product/src/application/translate.use.case.ts:27:47
         this._store.setTranslations(response);
       },
       error: (error) => {
-        this._errorHandler.handleError(error, 'Failed to load translations.');
+        this._errorHandler.handleError(error, "");
         this._store.setLoading(false);
       },
killedBy: LoadTranslationsUseCase (Vitest) should call error handler and setLoading(false) on error
statusReason: expected "vi.fn()" to be called with arguments: [ Error: Network fail, …(1) ]

Received: 

  1st vi.fn() call:

  [
    Error {

[Killed] BooleanLiteral
product/src/application/translate.use.case.ts:28:32
       },
       error: (error) => {
         this._errorHandler.handleError(error, 'Failed to load translations.');
-        this._store.setLoading(false);
+        this._store.setLoading(true);
       },
       complete: () => {
killedBy: LoadTranslationsUseCase (Vitest) should call error handler and setLoading(false) on error
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
product/src/application/translate.use.case.ts:30:23
         this._errorHandler.handleError(error, 'Failed to load translations.');
         this._store.setLoading(false);
       },
-      complete: () => {
-        this._store.setLoading(false);
-      },
+      complete: () => {},
     });
   }
killedBy: LoadTranslationsUseCase (Vitest) should load translations, update store and stop loading on success
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
product/src/application/translate.use.case.ts:31:32
         this._store.setLoading(false);
       },
       complete: () => {
-        this._store.setLoading(false);
+        this._store.setLoading(true);
       },
     });
killedBy: LoadTranslationsUseCase (Vitest) should load translations, update store and stop loading on success
statusReason: expected true to be false // Object.is equality
