[Killed] BlockStatement
product/src/application/update.product.use.case.ts:27:75
     private readonly _toastService: ToastService
   ) {}
 
-  execute(input: IUpdateProductInput): Observable<IUpdateProductResponse> {
-    this._store.setLoading(true);
-    return this._service.updateProduct(input.id, input.product).pipe(
-      tap((response) => {
-        this._store.updateProduct(input.id, response.data);
-        this._toastService.showToast(
-          'Operación Exitosa',
-          `Producto "${input.product.name}" actualizado correctamente`,
-          'success'
-        );
-      }),
-      catchError((error) => {
-        console.error(`Error updating product with ID ${input.id}:`, error);
-        this._errorHandler.handleError(
-          error,
-          `Error updating product with ID ${input.id}`
-        );
-        return throwError(() => error);
-      }),
-      finalize(() => {
-        this._store.setLoading(false);
-      })
-    );
-  }
+  execute(input: IUpdateProductInput): Observable<IUpdateProductResponse> {}
 }
 
killedBy: UpdateProductUseCase (Vitest) should update product, show toast and stop loading on success
statusReason: Cannot read properties of undefined (reading 'subscribe')

[Killed] BooleanLiteral
product/src/application/update.product.use.case.ts:28:28
   ) {}
 
   execute(input: IUpdateProductInput): Observable<IUpdateProductResponse> {
-    this._store.setLoading(true);
+    this._store.setLoading(false);
     return this._service.updateProduct(input.id, input.product).pipe(
       tap((response) => {
killedBy: UpdateProductUseCase (Vitest) should update product, show toast and stop loading on success
statusReason: expected "vi.fn()" to be called with arguments: [ true ]

Received: 

  1st vi.fn() call:

  [
-   true,

[Killed] BlockStatement
product/src/application/update.product.use.case.ts:30:25
   execute(input: IUpdateProductInput): Observable<IUpdateProductResponse> {
     this._store.setLoading(true);
     return this._service.updateProduct(input.id, input.product).pipe(
-      tap((response) => {
-        this._store.updateProduct(input.id, response.data);
-        this._toastService.showToast(
-          'Operación Exitosa',
-          `Producto "${input.product.name}" actualizado correctamente`,
-          'success'
-        );
-      }),
+      tap((response) => {}),
       catchError((error) => {
         console.error(`Error updating product with ID ${input.id}:`, error);
killedBy: UpdateProductUseCase (Vitest) should update product, show toast and stop loading on success
statusReason: expected "vi.fn()" to be called with arguments: [ 'P01', { name: 'Updated product' } ]

Number of calls: 0

[Killed] StringLiteral
product/src/application/update.product.use.case.ts:34:11
         this._store.updateProduct(input.id, response.data);
         this._toastService.showToast(
           'Operación Exitosa',
-          `Producto "${input.product.name}" actualizado correctamente`,
+          ``,
           'success'
         );
killedBy: UpdateProductUseCase (Vitest) should update product, show toast and stop loading on success
statusReason: expected "vi.fn()" to be called with arguments: [ 'Operación Exitosa', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "Operación Exitosa",

[Killed] BlockStatement
product/src/application/update.product.use.case.ts:38:29
           'success'
         );
       }),
-      catchError((error) => {
-        console.error(`Error updating product with ID ${input.id}:`, error);
-        this._errorHandler.handleError(
-          error,
-          `Error updating product with ID ${input.id}`
-        );
-        return throwError(() => error);
-      }),
+      catchError((error) => {}),
       finalize(() => {
         this._store.setLoading(false);
killedBy: UpdateProductUseCase (Vitest) should log correct error message when update fails
statusReason: expected "error" to be called with arguments: [ …(2) ]

Number of calls: 0
